# Data Structures in Pandas

Pandas has two different data structures:
* Series
* Data Frames

Series represents data in 1D form while data frames represent data in 2D tabular form. 

Series - one dimensional array with labels

Python dictionaries - data structures for storing key-value pairs

In [1]:
import pandas as pd

In [2]:
dict = {'a': 3, 'b':'cat', 'c':2.5}
pd.Series(dict)

a      3
b    cat
c    2.5
dtype: object

# Creating series using 2 lists

In [3]:
val = pd.Series([100, 'cat', 310, 'gog', 500], ['Amy', 'Bobby', 'Cat', 'Don', 'Emma'])
val

Amy      100
Bobby    cat
Cat      310
Don      gog
Emma     500
dtype: object

In [4]:
# loc is a label-location based indexer for selection by labels 
val.loc[['Cat', 'Emma']]

Cat     310
Emma    500
dtype: object

In [5]:
val[[0,3,4]]

Amy     100
Don     gog
Emma    500
dtype: object

In [6]:
# iloc is primarily integer based (from 0 to length-1 of the axis)
val.iloc[1]

'cat'

In [7]:
# check if there is a cat in the Series index

'cat' in val

False

In [8]:
'Cat' in val

True

DataFrames - 2D data structure stores data in tabular form (rows and columns)
* <class 'pandas.core.frame.DataFrame'>

In [9]:
d = {'A': pd.Series([100., 200., 300.], index = ['apple','pear','orange']),
     'B': pd.Series([111.,222.,333.,444.], index = ['apple','pear','orange','melon'])}

In [10]:
df = pd.DataFrame(d)
print(df)

            A      B
apple   100.0  111.0
melon     NaN  444.0
orange  300.0  333.0
pear    200.0  222.0

In [11]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [12]:
df.index

Index(['apple', 'melon', 'orange', 'pear'], dtype='object')

In [13]:
df.columns

Index(['A', 'B'], dtype='object')

In [14]:
pd.DataFrame(df, index=['orange', 'melon','apple'], columns=['A'])

            A
orange  300.0
melon     NaN
apple   100.0

# Read csv files

In [15]:
df = pd.read_csv('Resp2.csv')

In [16]:
df.head()

   experience  respiration
0           0         3.94
1           0         4.26
2           0         4.16
3           0         3.76
4           0         4.07

In [17]:
#reading comma separated files with .csv extension
df2 = pd.read_csv('winequality-red.csv', sep =';')
df2.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

# Reading txt files

In [18]:
df3 = pd.read_csv('bostonTxt.txt', sep = '\t')
df3.head()

     MV  INDUS   NOX     RM  TAX    PT  LSTAT
0  24.0   2.31  53.8  6.575  296  15.3   4.98
1  21.6   7.07  46.9  6.421  242  17.8   9.14
2  34.7   7.07  46.9  7.185  242  17.8   4.03
3  33.4   2.18  45.8  6.998  222  18.7   2.94
4  36.2   2.18  45.8  7.147  222  18.7   5.33

# Reading xls files

Advantage of xls files over csv and txt files is that it has multiple sheets

In [32]:
xl = pd.ExcelFile(r'C:\Users\hsripuram\Desktop\MLPractice\PreProcessing\boston1.xls')
print(xl.sheet_names)

['Sheet1', 'Sheet2']

In [34]:
df5 = xl.parse('Sheet1')

df5.head()

,MV,INDUS,NOX,RM,TAX,PT,LSTAT,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,24.0,2.31,53.8,6.575,296,15.3,4.98,NaN,NaN,Subset of Boston housing tract
1,21.6,7.07,46.9,6.421,242,17.8,9.14,NaN,NaN,data of Harrison and Rubinfeld
2,34.7,7.07,46.9,7.185,242,17.8,4.03,NaN,NaN,(1978). Each case is one U.S.
3,33.4,2.18,45.8,6.998,222,18.7,2.94,NaN,NaN,Census tract in the Boston area.
4,36.2,2.18,45.8,7.147,222,18.7,5.33,NaN,NaN,NaN

# Web Scraping

In [35]:
import html5lib

In [36]:
uss = pd.read_html('https://simple.wikipedia.org/wiki/List_of_U.S._states')

In [37]:
print(type(uss)) # this is list of DataFrames

<class 'list'>

In [38]:
u = uss[0]
print(u)

                            Name postal abbreviation[1]          Cities  \
                            Name postal abbreviation[1]         Capital
0                        Alabama                     AL      Montgomery
1                         Alaska                     AK          Juneau
2                        Arizona                     AZ         Phoenix
3                       Arkansas                     AR     Little Rock
4                     California                     CA      Sacramento
5                       Colorado                     CO          Denver
6                    Connecticut                     CT        Hartford
7                       Delaware                     DE           Dover
8                        Florida                     FL     Tallahassee
9                        Georgia                     GA         Atlanta
10                        Hawaii                     HI        Honolulu
11                         Idaho                     ID           Boise
12                      Illinois                     IL     Springfield
13                       Indiana                     IN    Indianapolis
14                          Iowa                     IA      Des Moines
15                        Kansas                     KS          Topeka
16       Kentucky[upper-alpha 3]                     KY       Frankfort
17                     Louisiana                     LA     Baton Rouge
18                         Maine                     ME         Augusta
19                      Maryland                     MD       Annapolis
20  Massachusetts[upper-alpha 3]                     MA          Boston
21                      Michigan                     MI         Lansing
22                     Minnesota                     MN        St. Paul
23                   Mississippi                     MS         Jackson
24                      Missouri                     MO  Jefferson City
25                       Montana                     MT          Helena
26                      Nebraska                     NE         Lincoln
27                        Nevada                     NV     Carson City
28                 New Hampshire                     NH         Concord
29                    New Jersey                     NJ         Trenton
30                    New Mexico                     NM        Santa Fe
31                      New York                     NY          Albany
32                North Carolina                     NC         Raleigh
33                  North Dakota                     ND        Bismarck
34                          Ohio                     OH        Columbus
35                      Oklahoma                     OK   Oklahoma City
36                        Oregon                     OR           Salem
37   Pennsylvania[upper-alpha 3]                     PA      Harrisburg
38   Rhode Island[upper-alpha 4]                     RI      Providence
39                South Carolina                     SC        Columbia
40                  South Dakota                     SD          Pierre
41                     Tennessee                     TN       Nashville
42                         Texas                     TX          Austin
43                          Utah                     UT  Salt Lake City
44                       Vermont                     VT      Montpelier
45       Virginia[upper-alpha 3]                     VA        Richmond
46                    Washington                     WA         Olympia
47                 West Virginia                     WV      Charleston
48                     Wisconsin                     WI         Madison
49                       Wyoming                     WY        Cheyenne

                   Established[upper-alpha 1] Population[upper-alpha 2][3]  \
        Largest[5] Established[upper-alpha 1] Population[upper-alpha 2][3]
0       Birmingham               Dec 14, 1819                      4874747
1        Anchorage                Jan 3, 1959                       739795
2          Phoenix               Feb 14, 1912                      7016270
3      Little Rock               Jun 15, 1836                      3004279
4      Los Angeles                Sep 9, 1850                     39536653
5           Denver                Aug 1, 1876                      5607154
6       Bridgeport                Jan 9, 1788                      3588184
7       Wilmington                Dec 7, 1787                       961939
8     Jacksonville                Mar 3, 1845                     20984400
9          Atlanta                Jan 2, 1788                     10429379
10        Honolulu               Aug 21, 1959                      1427538
11           Boise                Jul 3, 1890                      1716943
12         Chicago                Dec 3, 1818                     12802023
13    Indianapolis               Dec 11, 1816                      6666818
14      Des Moines               Dec 28, 1846                      3145711
15         Wichita               Jan 29, 1861                      2913123
16      Louisville                Jun 1, 1792                      4454189
17     New Orleans               Apr 30, 1812                      4684333
18        Portland               Mar 15, 1820                      1335907
19       Baltimore               Apr 28, 1788                      6052177
20          Boston                Feb 6, 1788                      6859819
21         Detroit               Jan 26, 1837                      9962311
22     Minneapolis               May 11, 1858                      5576606
23         Jackson               Dec 10, 1817                      2984100
24     Kansas City               Aug 10, 1821                      6113532
25        Billings                Nov 8, 1889                      1050493
26           Omaha                Mar 1, 1867                      1920076
27       Las Vegas               Oct 31, 1864                      2998039
28      Manchester               Jun 21, 1788                      1342795
29          Newark               Dec 18, 1787                      9005644
30     Albuquerque                Jan 6, 1912                      2088070
31        New York               Jul 26, 1788                     19849399
32       Charlotte               Nov 21, 1789                     10273419
33           Fargo                Nov 2, 1889                       755393
34        Columbus                Mar 1, 1803                     11658609
35   Oklahoma City               Nov 16, 1907                      3930864
36        Portland               Feb 14, 1859                      4142776
37    Philadelphia               Dec 12, 1787                     12805537
38      Providence               May 29, 1790                      1059639
39      Charleston               May 23, 1788                      5024369
40     Sioux Falls                Nov 2, 1889                       869666
41       Nashville                Jun 1, 1796                      6715984
42         Houston               Dec 29, 1845                     28304596
43  Salt Lake City                Jan 4, 1896                      3101833
44      Burlington                Mar 4, 1791                       623657
45  Virginia Beach               Jun 25, 1788                      8470020
46         Seattle               Nov 11, 1889                      7405743
47      Charleston               Jun 20, 1863                      1815857
48       Milwaukee               May 29, 1848                      5795483
49        Cheyenne               Jul 10, 1890                       579315

   Total area[4]          Land area[4]          Water area[4]          \
             mi2      km2          mi2      km2           mi2     km2
0          52420   135767        50645   131171          1775    4597
1         665384  1723337       570641  1477953         94743  245384
2         113990   295234       113594   294207           396    1026
3          53179   137732        52035   134771          1143    2961
4         163695   423967       155779   403466          7916   20501
5         104094   269601       103642   268431           452    1170
6           5543    14357         4842    12542           701    1816
7           2489     6446         1949     5047           540    1399
8          65758   170312        53625   138887         12133   31424
9          59425   153910        57513   148959          1912    4951
10         10932    28313         6423    16635          4509   11678
11         83569   216443        82643   214045           926    2398
12         57914   149995        55519   143793          2395    6202
13         36420    94326        35826    92789           593    1537
14         56273   145746        55857   144669           416    1077
15         82278   213100        81759   211754           520    1346
16         40408   104656        39486   102269           921    2387
17         52378   135659        43204   111898          9174   23761
18         35380    91633        30843    79883          4537   11750
19         12406    32131         9707    25142          2699    6990
20         10554    27336         7800    20202          2754    7134
21         96714   250487        56539   146435         40175  104052
22         86936   225163        79627   206232          7309   18930
23         48432   125438        46923   121531          1508    3907
24         69707   180540        68742   178040           965    2501
25        147040   380831       145546   376962          1494    3869
26         77348   200330        76824   198974           524    1356
27        110572   286380       109781   284332           791    2048
28          9349    24214         8953    23187           397    1027
29          8723    22591         7354    19047          1368    3544
30        121590   314917       121298   314161           292     757
31         54555   141297        47126   122057          7429   19240
32         53819   139391        48618   125920          5201   13471
33         70698   183108        69001   178711          1698    4397
34         44826   116098        40861   105829          3965   10269
35         69899   181037        68595   177660          1304    3377
36         98379   254799        95988   248608          2391    6191
37         46054   119280        44743   115883          1312    3397
38          1545     4001         1034     2678           511    1324
39         32020    82933        30061    77857          1960    5076
40         77116   199729        75811   196350          1305    3379
41         42144   109153        41235   106798           909    2355
42        268596   695662       261232   676587          7365   19075
43         84897   219882        82170   212818          2727    7064
44          9616    24906         9217    23871           400    1035
45         42775   110787        39490   102279          3285    8508
46         71298   184661        66456   172119          4842   12542
47         24230    62756        24038    62259           192     497
48         65496   169635        54158   140268         11339   29367
49         97813   253335        97093   251470           720    1864

   Numberof Reps.
   Numberof Reps.
0               7
1               1
2               9
3               4
4              53
5               7
6               5
7               1
8              27
9              14
10              2
11              2
12             18
13              9
14              4
15              4
16              6
17              6
18              2
19              8
20              9
21             14
22              8
23              4
24              8
25              1
26              3
27              4
28              2
29             12
30              3
31             27
32             13
33              1
34             16
35              5
36              5
37             18
38              2
39              7
40              1
41              9
42             36
43              4
44              1
45             11
46             10
47              3
48              8
49              1

In [39]:
url = 'http://www.fdic.gov/bank/individual/failed/banklist.html'

df6 = pd.read_html(url)

print(type(df6))

<class 'list'>

In [40]:
df0 = df6[0]
print(df0)

                               Bank Name        City  ST   CERT  \
0       City National Bank of New Jersey      Newark  NJ  21111
1                          Resolute Bank      Maumee  OH  58317
2                  Louisa Community Bank      Louisa  KY  58112
3                   The Enloe State Bank      Cooper  TX  10716
4    Washington Federal Bank for Savings     Chicago  IL  30570
..                                   ...         ...  ..    ...
554                   Superior Bank, FSB    Hinsdale  IL  32646
555                  Malta National Bank       Malta  OH   6629
556      First Alliance Bank & Trust Co.  Manchester  NH  34264
557    National State Bank of Metropolis  Metropolis  IL   3815
558                     Bank of Honolulu    Honolulu  HI  21029

                   Acquiring Institution       Closing Date       Updated Date
0                        Industrial Bank   November 1, 2019   November 7, 2019
1                     Buckeye State Bank   October 25, 2019  November 12, 2019
2      Kentucky Farmers Bank Corporation   October 25, 2019   November 7, 2019
3                     Legend Bank, N. A.       May 31, 2019    August 22, 2019
4                     Royal Savings Bank  December 15, 2017      July 24, 2019
..                                   ...                ...                ...
554                Superior Federal, FSB      July 27, 2001    August 19, 2014
555                    North Valley Bank        May 3, 2001  November 18, 2002
556  Southern New Hampshire Bank & Trust   February 2, 2001  February 18, 2003
557              Banterra Bank of Marion  December 14, 2000     March 17, 2005
558                   Bank of the Orient   October 13, 2000     March 17, 2005

[559 rows x 7 columns]

In [41]:
newUrl = pd.read_html('https://en.wikipedia.org/wiki/List_of_World_Heritage_Sites_in_South_Korea')

In [42]:
newUr = newUrl[0]
print(newUr)

                                                 Site  Image  \
0                Seokguram Grotto and Bulguksa Temple    NaN
1   Haeinsa Temple Janggyeong Panjeon, the Deposit...    NaN
2                                      Jongmyo Shrine    NaN
3                        Changdeokgung Palace Complex    NaN
4                                   Hwaseong Fortress    NaN
5            Gochang, Hwasun and Ganghwa Dolmen Sites    NaN
6                             Gyeongju Historic Areas    NaN
7                 Jeju Volcanic Island and Lava Tubes    NaN
8                   Royal Tombs of the Joseon Dynasty    NaN
9      Historic Villages of Korea: Hahoe and Yangdong    NaN
10                                     Namhansanseong    NaN
11                              Baekje Historic Areas    NaN
12      Sansa, Buddhist Mountain Monasteries in Korea    NaN
13             Seowon, Korean Neo-Confucian Academies    NaN

                                             Location  Year listed  \
0                                    North Gyeongsang         1995
1                                    South Gyeongsang         1995
2                                               Seoul         1995
3                                               Seoul         1997
4                                            Gyeonggi         1997
5              Incheon, North Jeolla and South Jeolla         2000
6                                    North Gyeongsang         2000
7                                                Jeju         2007
8                                  Gyeonggi and Seoul         2009
9                                    North Gyeongsang         2010
10                                           Gyeonggi         2014
11                 South Chungcheong and North Jeolla         2015
12  North Chungcheong, North Gyeongsang, South Chu...         2018
13  Daegu, North Gyeongsang, North Jeolla, South C...         2019

               UNESCO data Description
0         Cultural:(i)(iv)         [8]
1        Cultural:(iv)(vi)         [9]
2            Cultural:(iv)        [10]
3   Cultural:(ii)(iii)(iv)        [11]
4       Cultural:(ii)(iii)        [12]
5           Cultural:(iii)        [13]
6       Cultural:(ii)(iii)        [14]
7      Natural:(vii)(viii)        [15]
8   Cultural:(iii)(iv)(vi)        [16]
9       Cultural:(iii)(iv)        [17]
10       Cultural:(ii)(iv)        [18]
11      Cultural:(ii)(iii)        [19]
12          Cultural:(iii)        [20]
13          Cultural:(iii)        [21]

All the above html pages have only 1 table. If there are more than 1 table per webpage

In [44]:
pines = pd.read_html('https://en.wikipedia.org/wiki/List_of_World_Heritage_Sites_in_Philippines')
pine = pines[0]
print(pine)

                                                Name  Image  \
0  Baroque Churches of the Philippines: San Agust...    NaN
1                       Tubbataha Reefs Natural Park    NaN
2  Rice Terraces of the Philippine Cordilleras: B...    NaN
3                             Historic City of Vigan    NaN
4   Puerto Princesa Subterranean River National Park    NaN
5          Mount Hamiguitan Range Wildlife Sanctuary    NaN

                                           Location  \
0  City of Manila; Ilocos Sur; Ilocos Norte; Iloilo
1                                           Palawan
2                                            Ifugao
3                                        Ilocos Sur
4                                           Palawan
5                                    Davao Oriental

                              Regions  \
0  Manila; Ilocandia; Western Visayas
1                            Mimaropa
2                          Cordillera
3                           Ilocandia
4                            Mimaropa
5                               Davao

                                         UNESCO data             Period  \
0  1993 (inscription), 2013 (minor boundary modif...       16th century
1   1993 (inscription), 2009 (extension); vii, ix, x  Pleistocene Epoch
2                     1995 (inscription); iii, iv, v       16th century
3                         1999 (inscription); ii, iv       16th century
4                          1999 (inscription); vii,x  Pleistocene Epoch
5                              2014 (inscription); x  Pleistocene Epoch

                                         Description   Ref
0  All of the four baroque churches have been dec...   [5]
1  The site is one of the New7Wonders of Nature, ...   [6]
2  The inscription includes 5 properties, namely,...   [7]
3  The site is also one of the New7Wonders Cities...   [8]
4  The site is part of the Palawan UNESCO Biosphe...   [9]
5        The site is a declared ASEAN Heritage Park.  [10]

In [45]:
pine1 = pines[1]
print(pine1)

                      Type (criteria)  \
0               Natural: (vii)(ix)(x)
1       Cultural: (i)(iii)(iv)(v)(vi)
2                               Mixed
3              Cultural: (iii)(iv)(v)
4                Natural: (vii)(viii)
5                 Mixed: (iii)(ix)(x)
6                    Natural: (ix)(x)
7   Cultural: (i)(ii)(iii)(iv)(v)(vi)
8                   Natural: (vii)(x)
9                    Natural: (ix)(x)
10              Natural: (vii)(ix)(x)
11                   Natural: (ix)(x)
12                   Natural: (ix)(x)
13         Cultural: (ii)(iii)(iv)(v)
14                   Natural: (ix)(x)
15         Cultural: (ii)(iii)(iv)(v)
16                    Cultural: (iii)
17         Cultural: (ii)(iii)(iv)(v)
18                   Natural: (ix)(x)

                                                 Site  \
0                               Apo Reef Natural Park
1   Baroque Churches of the Philippines (Extension...
2          Batanes Protected landscapes and seascapes
3                          Butuan Archeological Sites
4                    Chocolate Hills Natural Monument
5                    Coron Island Natural Biotic Area
6      El Nido-Taytay Managed Resource Protected Area
7                          Kabayan Mummy Burial Caves
8                  Mayon Volcano Natural Park (MMVNP)
9                     Mounts Iglit-Baco National Park
10                 Mount Malindang Range Natural Park
11            Mount Mantalingajan Protected Landscape
12                          Mount Pulag National Park
13  Neolithic Shell Midden Sites in Lal-lo and Gat...
14  Northern Sierra Madre Natural Park and outlyin...
15  Paleolithic Archaeological Sites in Cagayan Va...
16  Petroglyphs and Petrographs of the Philippines...
17           The Tabon Cave Complex and all of Lipuun
18                  Turtle Islands Wildlife Sanctuary

                              Location                        Period  \
0                             Sulu Sea             Pleistocene Epoch
1                    Various Locations        18th to 19th centuries
2                              Batanes  Pleistocene Epoch and 100 AD
3                     Agusan del Norte                  10th century
4                                Bohol             Pleistocene Epoch
5                              Palawan             Pleistocene Epoch
6                              Palawan             Pleistocene Epoch
7                              Benguet                        100 AD
8                                Albay             Pleistocene Epoch
9                              Mindoro             Pleistocene Epoch
10                  Misamis Occidental             Pleistocene Epoch
11                             Palawan             Pleistocene Epoch
12  Ifugao, Nueva Viscaya, and Benguet             Pleistocene Epoch
13                             Cagayan              Neolithic Period
14                             Isabela             Pleistocene Epoch
15                      Cagayan Valley            Paleolithic Period
16                  Multiple locations            Paleolithic Period
17                             Palawan            Paleolithic Period
18                           Tawi-Tawi             Pleistocene Epoch

                                          Description  Image   Ref
0   The site is the second biggest producer of juv...    NaN  [12]
1   All five baroque churches have been declared a...    NaN  [13]
2   The Mahatao Church of Batanes is a declared Na...    NaN  [14]
3   The site exemplified and concretized the capab...    NaN  [15]
4   The site is the focal property of the proposed...    NaN  [16]
5   The site is within the Palawan UNESCO Biospher...    NaN  [17]
6   The site is within the Palawan UNESCO Biospher...    NaN  [18]
7   The site has been listed by the World Monument...    NaN  [19]
8   The site is the central property of the Albay ...    NaN  [20]
9         The site is a declared ASEAN Heritage Park.    NaN  [21]
10        The site is a declared ASEAN Heritage Park.    NaN  [22]
11  The site is part of the Palawan UNESCO Biosphe...    NaN  [23]
12  The site is the third highest point in the Phi...    NaN  [24]
13  The site is the largest shell midden zone in t...    NaN  [25]
14  The site is the largest national park in the P...    NaN  [26]
15  The site includes the location where the bone ...    NaN  [27]
16  The sites in Singnapan, Alab, and Angono have ...    NaN  [28]
17  The site is a declared National Cultural Treas...    NaN  [29]
18  The site is a major green sea turtle breeding ...    NaN  [30]

In [46]:
pine2 = pines[2]
print(pine2)

  vteWorld Heritage Sites in the Philippines  \
0                                   Cultural
1                                    Natural

        vteWorld Heritage Sites in the Philippines.1  \
0  Baroque Churches of the Philippines (San Agust...
1  Mount Hamiguitan Range Wildlife Sanctuary Puer...

   vteWorld Heritage Sites in the Philippines.2
0                                           NaN
1                                           NaN

# Read JSON data

In [50]:
df7 = pd.read_json('C:\Users\hsripuram\Desktop\MLPractice\PreProcessing\example_1.json')

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (<ipython-input-50-564fba9913b8>, line 1)

In [51]:
df8 = pd.read_json('https://api.github.com/repos/pydata/pandas/issues?per_page=5')

In [52]:
df8.head()

,url,repository_url,labels_url,comments_url,events_url,html_url,id,node_id,number,title,...,assignee,assignees,milestone,comments,created_at,updated_at,closed_at,author_association,pull_request,body
0,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/29840,528277651,MDExOlB1bGxSZXF1ZXN0MzQ1MzY5Nzc5,29840,DEPR: remove FrozenNDarray,...,NaN,[],None,0,2019-11-25 19:02:52+00:00,2019-11-25 19:02:52+00:00,NaT,MEMBER,{'url': 'https://api.github.com/repos/pandas-d...,Reboots #29335.
1,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/issues/29839,528239797,MDU6SXNzdWU1MjgyMzk3OTc=,29839,PERF: improve Integer/BooleanArray astype to n...,...,NaN,[],{'url': 'https://api.github.com/repos/pandas-d...,1,2019-11-25 17:45:38+00:00,2019-11-25 18:01:59+00:00,NaT,MEMBER,NaN,"Currently, in the IntegerArray or BooleanArray..."
2,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/issues/29838,528237789,MDU6SXNzdWU1MjgyMzc3ODk=,29838,PERF: improve conversion to BooleanArray from ...,...,NaN,[],{'url': 'https://api.github.com/repos/pandas-d...,0,2019-11-25 17:41:38+00:00,2019-11-25 17:41:39+00:00,NaT,MEMBER,NaN,"Currently, the creation of a BooleanArray from..."
3,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/issues/29837,528235995,MDU6SXNzdWU1MjgyMzU5OTU=,29837,groupby() drops categorical columns when aggre...,...,NaN,[],None,2,2019-11-25 17:37:52+00:00,2019-11-25 18:16:28+00:00,NaT,NONE,NaN,"#### Code Sample, a copy-pastable example if p..."
4,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/29836,528196106,MDExOlB1bGxSZXF1ZXN0MzQ1MzA1MDYw,29836,XLSB support,...,NaN,[],None,1,2019-11-25 16:26:33+00:00,2019-11-25 18:58:55+00:00,NaT,NONE,{'url': 'https://api.github.com/repos/pandas-d...,"Hey all, a moderately commonly requested featu..."